RT-Thread/rt-thread/bsp/nxp/mcx/mcxa/Libraries/MCXA153/MCXA153/drivers/fsl_i3c.c
        /* Move to stop when the transfer is done. */
        if (--handle->remainingBytes == 0UL)
        {
            handle->state = (uint8_t)kWaitForCompletionState;
        }
    }
    else
    {
        /* Make sure there is data in the rx fifo. */
        if (0UL == (stateParams->rxCount)--)
        {
            stateParams->state_complete = true;
            return;
        }

        /* Read byte from fifo. */
        dataBuff.puint8       = (uint8_t *)handle->transfer.data;
        *dataBuff.puint8      = (uint8_t)base->MRDATAB;
        dataBuff.u32          = dataBuff.u32 + 1U;
        handle->transfer.data = (void *)(dataBuff.puint8);

        /* Move to stop when the transfer is done. */
        if (--handle->remainingBytes == 0UL)
        {
            handle->state = (uint8_t)kWaitForCompletionState;
        }

        if ((handle->rxTermOps == kI3C_RxTermLastByte) && (handle->remainingBytes == 1UL))
        {
            base->MCTRL |= I3C_MCTRL_RDTERM(1UL);
        }
    }
}

static void I3C_TransferStateMachineWaitForCompletionState(i3c_master_handle_t *handle,
                                                           i3c_master_state_machine_param_t *stateParams)
{
    /* We stay in this state until the maste complete. */
    if (0UL != (stateParams->status & (uint32_t)kI3C_MasterCompleteFlag))
    {
        handle->state = (uint8_t)kStopState;
    }
    else
    {
        stateParams->state_complete = true;
    }
}

static void I3C_TransferStateMachineStopState(I3C_Type *base,
                                              i3c_master_handle_t *handle,
                                              i3c_master_state_machine_param_t *stateParams)
{
    /* Only issue a stop transition if the caller requested it. */
    if (0UL == (handle->transfer.flags & (uint32_t)kI3C_TransferNoStopFlag))
    {
        /* Make sure there is room in the tx fifo for the stop command. */
        if (0UL == (stateParams->txCount)--)
        {
            stateParams->state_complete = true;
            return;
        }
        if (handle->transfer.busType == kI3C_TypeI3CDdr)
        {
            I3C_MasterEmitRequest(base, kI3C_RequestForceExit);
        }
        else
        {
            (void)I3C_MasterEmitStop(base, false);
        }
    }
    stateParams->state_complete = true;
}

static status_t I3C_RunTransferStateMachine(I3C_Type *base, i3c_master_handle_t *handle, bool *isDone)
{
    i3c_master_state_machine_param_t stateParams;
    (void)memset(&stateParams, 0, sizeof(stateParams));

    stateParams.result         = kStatus_Success;
    stateParams.state_complete = false;

    /* Set default isDone return value. */
    *isDone = false;

    uint32_t errStatus;
    size_t txFifoSize =
        2UL << ((base->SCAPABILITIES & I3C_SCAPABILITIES_FIFOTX_MASK) >> I3C_SCAPABILITIES_FIFOTX_SHIFT);

    /* Check for errors. */
    stateParams.status = (uint32_t)I3C_MasterGetPendingInterrupts(base);
    I3C_MasterClearStatusFlags(base, stateParams.status);

    stateParams.masterState = I3C_MasterGetState(base);
    errStatus               = I3C_MasterGetErrorStatusFlags(base);
    stateParams.result      = I3C_MasterCheckAndClearError(base, errStatus);
    if (kStatus_Success != stateParams.result)
    {
        return stateParams.result;
    }

    if (0UL != (stateParams.status & (uint32_t)kI3C_MasterSlave2MasterFlag))
    {
        if (handle->callback.slave2Master != NULL)
        {
            handle->callback.slave2Master(base, handle->userData);
        }
    }

    if ((0UL != (stateParams.status & (uint32_t)kI3C_MasterSlaveStartFlag)) &&
        (handle->transfer.busType != kI3C_TypeI2C))
    {
        handle->state = (uint8_t)kSlaveStartState;
    }

    if ((stateParams.masterState == kI3C_MasterStateIbiRcv) || (stateParams.masterState == kI3C_MasterStateIbiAck))
    {
        handle->state = (uint8_t)kIBIWonState;
    }

    if (handle->state == (uint8_t)kIdleState)
    {
        return stateParams.result;
    }

    /* Get fifo counts and compute room in tx fifo. */
    I3C_MasterGetFifoCounts(base, &stateParams.rxCount, &stateParams.txCount);
    stateParams.txCount = txFifoSize - stateParams.txCount;

    while (!stateParams.state_complete)
    {
        /* Execute the state. */
        switch (handle->state)
        {
            case (uint8_t)kSlaveStartState:
                /* Emit start + 0x7E */
                I3C_MasterEmitRequest(base, kI3C_RequestAutoIbi);
                handle->state              = (uint8_t)kIBIWonState;
                stateParams.state_complete = true;
                break;

            case (uint8_t)kIBIWonState:
                I3C_TransferStateMachineIBIWonState(base, handle, &stateParams);
                break;

            case (uint8_t)kSendCommandState:
                I3C_TransferStateMachineSendCommandState(base, handle, &stateParams);
                break;

            case (uint8_t)kWaitRepeatedStartCompleteState:
                I3C_TransferStateMachineWaitRepeatedStartCompleteState(base, handle, &stateParams);
                break;

            case (uint8_t)kTransferDataState:
                I3C_TransferStateMachineTransferDataState(base, handle, &stateParams);
                break;

            case (uint8_t)kWaitForCompletionState:
                I3C_TransferStateMachineWaitForCompletionState(handle, &stateParams);
                break;

            case (uint8_t)kStopState:
                I3C_TransferStateMachineStopState(base, handle, &stateParams);
                *isDone = true;
                break;

            default:
                assert(false);
                break;
        }
    }
    return stateParams.result;
}

static status_t I3C_InitTransferStateMachine(I3C_Type *base, i3c_master_handle_t *handle)
{
    i3c_master_transfer_t *xfer = &handle->transfer;
    status_t result             = kStatus_Success;
    i3c_direction_t direction   = xfer->direction;

    if (xfer->busType != kI3C_TypeI3CDdr)
    {
        direction = (0UL != xfer->subaddressSize) ? kI3C_Write : xfer->direction;
    }

